Vulnerability-report-main/ADDRVAL-ESB/AddrValidation-war/src/test/resources/TEST_ONE_BATCH_NOD.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://validator5.AddressDoctor.com/Webservice5/v4">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:Process>
         <v4:parameters>
            <v4:ProcessMode>BATCH</v4:ProcessMode>
         </v4:parameters>
         <!--Optional:-->
         <v4:addresses>
            <!--Zero or more repetitions:-->
            <v4:Address>
               
               <v4:Street>
                  <!--Zero or more repetitions:-->
                  <v4:string>1405 Douglas Street</v4:string>
               </v4:Street>
               
               <v4:Locality>
                  <!--Zero or more repetitions:-->
                  <v4:string>Victoria</v4:string>
               </v4:Locality>
            
               <v4:Province>
                  <!--Zero or more repetitions:-->
                  <v4:string>BC</v4:string>
               </v4:Province>
               
               <v4:Country>
                  <!--Zero or more repetitions:-->
                  <v4:string>Canada</v4:string>
               </v4:Country>
               
               <!--NOT USED Zero or more repetitions:-->
               <v4:AdditionalAddressInformation>
                  <!--Optional:-->
                  <v4:Name>?</v4:Name>
                  <!--Optional:-->
                  <v4:Value>?</v4:Value>
               </v4:AdditionalAddressInformation>
               
               <v4:AddressDetailed>
                  <v4:Province>
                     <v4:ProvinceDetailed>
                        <v4:Item>2</v4:Item>
                        <v4:EXTENDED>British Columbia</v4:EXTENDED>
                     </v4:ProvinceDetailed>
                  </v4:Province>
               </v4:AddressDetailed>
               
            </v4:Address>
         </v4:addresses>
         <!--Optional:-->
         <v4:enrichments>
            <!--Zero or more repetitions:-->
            <v4:Enrichment>
               <!--Optional:-->
               <v4:Type>?</v4:Type>
               <!--Optional:-->
               <v4:PayloadXml>?</v4:PayloadXml>
            </v4:Enrichment>
         </v4:enrichments>
      </v4:Process>
   </soapenv:Body>
</soapenv:Envelope>